MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32MG14P732F256IM32/mcu.h
typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EFR32MG14P732F256IM32_Part */

/***************************************************************************//**
 * @defgroup EFR32MG14P732F256IM32_Peripheral_TypeDefs Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "efr32mg14p_msc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_emu.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_rmu.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_cmu.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_crypto.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_prs.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_ldma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_fpueh.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_timer.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_usart.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_cryotimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_adc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_vdac_opa.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_rtcc_cc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_rtcc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_rtc_comp.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_wdog_pch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_idac.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_smu.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_trng.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg14p_romtable.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFR32MG14P732F256IM32_Peripheral_TypeDefs  */

/***************************************************************************//**
 * @defgroup EFR32MG14P732F256IM32_Peripheral_Base Peripheral Memory Map
 * @{
 ******************************************************************************/

#define MSC_BASE          (0x400E0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400E3000UL) /**< EMU base address  */
#define RMU_BASE          (0x400E5000UL) /**< RMU base address  */
#define CMU_BASE          (0x400E4000UL) /**< CMU base address  */
#define CRYPTO0_BASE      (0x400F0000UL) /**< CRYPTO0 base address  */
#define CRYPTO_BASE       CRYPTO0_BASE   /**< Alias for CRYPTO0 base address */
#define GPIO_BASE         (0x4000A000UL) /**< GPIO base address  */
#define PRS_BASE          (0x400E6000UL) /**< PRS base address  */
#define LDMA_BASE         (0x400E2000UL) /**< LDMA base address  */
#define FPUEH_BASE        (0x400E1000UL) /**< FPUEH base address  */
#define GPCRC_BASE        (0x4001C000UL) /**< GPCRC base address  */
#define TIMER0_BASE       (0x40018000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40018400UL) /**< TIMER1 base address  */
#define WTIMER0_BASE      (0x4001A000UL) /**< WTIMER0 base address  */
#define USART0_BASE       (0x40010000UL) /**< USART0 base address  */
#define USART1_BASE       (0x40010400UL) /**< USART1 base address  */
#define LEUART0_BASE      (0x4004A000UL) /**< LEUART0 base address  */
#define LETIMER0_BASE     (0x40046000UL) /**< LETIMER0 base address  */
#define CRYOTIMER_BASE    (0x4001E000UL) /**< CRYOTIMER base address  */
#define PCNT0_BASE        (0x4004E000UL) /**< PCNT0 base address  */
#define I2C0_BASE         (0x4000C000UL) /**< I2C0 base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define ACMP0_BASE        (0x40000000UL) /**< ACMP0 base address  */
#define ACMP1_BASE        (0x40000400UL) /**< ACMP1 base address  */
#define VDAC0_BASE        (0x40008000UL) /**< VDAC0 base address  */
#define LESENSE_BASE      (0x40055000UL) /**< LESENSE base address  */
#define RTCC_BASE         (0x40042000UL) /**< RTCC base address  */
#define PRORTC_BASE       (0x40044000UL) /**< PRORTC base address  */
#define WDOG0_BASE        (0x40052000UL) /**< WDOG0 base address  */
#define WDOG1_BASE        (0x40052400UL) /**< WDOG1 base address  */
#define IDAC0_BASE        (0x40006000UL) /**< IDAC0 base address  */
#define SMU_BASE          (0x40022000UL) /**< SMU base address  */
#define TRNG0_BASE        (0x4001D000UL) /**< TRNG0 base address  */
#define DEVINFO_BASE      (0x0FE081B0UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xE00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

